/* If something went wrong, but the writing was generally successful */
" However, there was an error writing one or more of the files" = " However, there was an error writing one or more of the files";

/* Actionsheet message for stating that nothing was generated  */
"An error has occurred and no files have been generated." = "An error has occurred and no files have been generated.";

/* Title of an alert if there is an error getting content of a url */
"An Error Occurred" = "An Error Occurred";

/* The title for the action sheet saying something went wrong */
"An error occurred while verifying the JSON" = "An error occurred while verifying the JSON";

/* Cancel button in the overwrite files prompt */
"Cancel" = "Cancel";

/* Label to have the user select which folder to choose */
"Choose" = "Choose";

/* Button to dismiss an action sheet */
"OK" = "OK";

/* Prompt user gets to enter a URL */
"Enter URL..." = "Enter URL...";

/* No comment provided by engineer. */
"Expected content type %@, got %@" = "Expected content type %1$@, got %2$@";

/* No comment provided by engineer. */
"Expected status code %@, got %d" = "Expected status code %1$@, got %2$d";

/* Toolbar item name for General Preferences */
"General" = "General";

/* In the main screen, this is the button that writes out files */
"Generate Files" = "Generate Files";

/* In the main screen, this is the button that fetches data from a URL */
"Get Data" = "Get Data";

/* Error message to state the JSON didn't start with a {} or [] */
"JSON text did not start with array or object." = "JSON text did not start with array or object.";

/* Message when writing the files, nothing was written */
"No file were written to the disk" = "No file were written to the disk";

/* This is the current title of http options window that gets written */
"Options" = "Options";

/* In the save portion, the label to choose what language */
"Output Language" = "Output Language";

/* Button text to overwrite files */
"Overwrite Files" = "Overwrite Files";

/* The title of the prompt to tell the user they are about to overwrite the files in the existing application */
"Overwrite files?" = "Overwrite files?";

/* In the save portion, the label to choose what the package is */
"Package Name" = "Package Name";

/* In the save portion, the prompt to specify what the base class is */
"Base Class" = "Base Class";

/* Message in an actionsheet stating that the write is successful */
"Success!" = "Success!";

/* If there is nothing in the JSON field, state that there is nothing there */
"There is no content to parse." = "There is no content to parse.";

/* The prompt to tell the user they are about to overwrite the files in the existing application */
"This operation will overwrite files in this directory. Are you sure you want to continue?" = "A file or folder with the same name already exists at the destination. Replacing it will overwrite its current contents.";

/* In the main screen, this is the verify button that formats the JSON */
"Verify" = "Verify";

/* Success message in an action sheet */
"Your files have successfully been generated." = "Your files have successfully been generated.";

/* In the save portion, for objective C, determine whether or not to use ARC */
"Use Automatic Reference Counting" = "Use Automatic Reference Counting";

/* Instructions on how to use the application */
"Drag a file, paste your clipboard or load remote data into the pane below." = "Drag a file, paste your clipboard or load remote data into the pane below.";

/* Message to state the the JSON is valid */
"Valid data structure" = "Valid data structure";

/* This is a message stating that the JSON that is in the application is not of valid form */
"Invalid Data Structure" = "Invalid Data Structure";

/* "The letters to prepend to the file */
"Class Prefix" = "Class Prefix";

/*************** HTTP OPTIONS WINDOW STRINGS *************/

/* Title for the Method box in the HTTP Options window */
"Method" = "Method";

/* Title for the Headers box in the HTTP Options window */
"Headers" = "Headers";

/* Title for the field to enter a HTTP header key */
/* Title for the column of HTTP header keys */
"Key" = "Key";

/* Title for the field to enter a HTTP header value */
/* Title for the column of HTTP header values */
"Value" = "Value";

/* Title for the Add header button in the HTTP Options window */
"Add" = "Add";







